app/controllers/parser_controller.rb

	def status
		# parser = SFRParser.new(Store.where(:title => "Fantastika", :base_url => "http://www.fantastika-nn.ru", :pavilion_url => "/?id=218 /?id=240", :news_url => "/?id=201").first_or_create)
		# parser = SFRParser.new(Store.where(:title => "Respublika", :base_url => "http://www.respublika-nn.ru", :pavilion_url => "/?id=202", :news_url => "/?id=229").first_or_create)
		# parser = SFRParser.new(Store.where(:title => "7sky", :base_url => "http://7nebonnov.ru", :pavilion_url => "/?id=227 /?id=226", :news_url => "/?id=201 /?id=234", :cinema_url => "http://www.cinemapark.ru").first_or_create)
		parser = CinemaParser.new(Store.where(:title => "7sky", :base_url => "http://7nebonnov.ru", :pavilion_url => "/?id=227 /?id=226", :news_url => "/?id=201 /?id=234", :cinema_url => "http://www.cinemapark.ru").first_or_create)
---
INSERT INTO "news" ("content", "created_at", "date_publication", "store_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "pavilions" ("brand_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["brand_id", 1], ["category_id", 1], ["created_at", Mon, 27 May 2013 08:11:34 UTC +00:00], ["updated_at", Mon, 27 May 2013 08:11:34 UTC +00:00]]
INSERT INTO "stores" ("base_url", "cinema_url", "created_at", "news_url", "pavilion_url", "services_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "news".* FROM "news" WHERE "news"."store_id" = 1 AND "news"."title" = 'Во всех магазинах Camaieu - "скидка -20% на выборочные платья коллекции весна-лето 2013"' LIMIT 1